[
  {
    "id": 1,
    "name": "A",
    "desc": "Kontroluje prawidłową pracę wszelkich miękkich tkanek organizmu, np.: skóry, oczu, paznokci, włosów, błon śluzowych itp. Ludzki organizm potrafi magazynować ją w sobie, więc codzienne uzupełnianie jej nie jest konieczne. Ze względu na duże zapasy witaminy A w wątrobie - pierwsze objawy spowodowane jej brakiem w diecie zostaną dostrzeżone dopiero po kilku miesiącach.",
    "dailyMale": "800-1000",
    "dailyFem": "800-1000",
    "unit": "UGRAM",
    "danger": "W przypadku znacznego przekroczenia ilości tej witaminy mogą pojawić się objawy w postaci m.in. krwawienia z dziąseł, owrzodzenia jamy ustnej, bólu brzucha, głowy, kości, stawów. Ponadto może pojawić się drażliwość, gorączka, nadmierne wypadanie włosów, utrata apetytu, złe samopoczucie, senność.",
    "foodExample": "Tran, Wątroba drobiowa, Wątroba wołowa, Marchew, Natka pietruszki, Masło, Szpinak, Dynia, Jajko, Sałata, Pomidor",
    "imgName": "tran"
  },
  {
    "id": 2,
    "name": "B1",
    "desc": "Wspiera układ nerwowy oraz przemianę materii, przez co pomaga nam prawidłowo funkcjonować. Wspomaga funkcjonowanie układu nerwowego, wspomaga układ sercowo - naczyniowy, uczestniczy w procesie spalania węglowodanów (cukrów), wspomaga proces wzrostu.",
    "dailyMale": "1",
    "dailyFem": "0.8",
    "unit": "MGRAM",
    "danger": "Witamina ta nie jest toksyczna. Charakterystyczne objawy niedoboru to: drżenie mięśni, senność, opryszczka, obrzęki, kołatanie serca, nadpobudliwość.",
    "foodExample": "Pestki słonecznika, Kiełki pszenicy, Groch (suche nasiona), Szynka wieprzowa, Fasola (suche nasiona), Kasza gryczana, Orzechy laskowe, Wątroba wieprzowa, Chleb gracham, Chleb razowy",
    "imgName": "sloneczniki"
  },
  {
    "id": 3,
    "name": "B2",
    "desc": "Witamina B2 zwana z łaciny Ryboflawiną jest witaminą słabo rozpuszczalną w wodzie i podatną na działanie promieni UV (łatwo ulega zniszczeniu). Jest za to odporna na podgrzewanie i działanie kwasów mineralnych.",
    "dailyMale": "1,2",
    "dailyFem": "1,2",
    "unit": "MGRAM",
    "danger": "Witamina ta nie jest toksyczna. O jej nadmiarze może świadczyć ciemnożółte zabarwienie moczu.",
    "foodExample": "Wątroba wieprzowa, Ser twarogowy, Groch (suche nasiona), Mięso wieprzowe, Fasola (suche nasiona), Mięso wołowe, Morszczuk, Mleko 2%",
    "imgName": "watroba"
  },
  {
    "id": 4,
    "name": "B3",
    "desc": "W odróżnieniu od pozostałych witamin z tej grupy witamina PP może być produkowana w ludzkim organizmie - nie są to jednak duże ilości i pozostałą część trzeba dostarczyć wraz z pożywieniem. Nawet niewielki niedobór niacyny (witaminy PP) może zostać przez nas zauważony, ponieważ spowolnienie metabolizmu zmniejsza naszą tolerancja na zimno. W przypadku większych niedoborów skutki są dużo bardziej dokuczliwe.",
    "dailyMale": "15-20",
    "dailyFem": "20",
    "unit": "MGRAM",
    "danger": "Zbyt duża ilość tej witaminy w organizmie może powodować uszkodzenie wątroby, arytmię serca, dolegliwości skórne (w postaci pieczenia i swędzenia). Zbyt duże dawki mogą prowadzić m.in. do ospałości, zaburzeń widzenia, spadku ciśnienia krwi.",
    "foodExample": "Wątróbka, Tuńczyk, Drób, Łosoś, Ryż, Pieczywo, Mleko i produkty mleczne",
    "imgName": "watrobka"
  },
  {
    "id": 5,
    "name": "B5",
    "desc": "Witamina B5 jest niezbędna dla każdej żywej komórki, mimo to rzadko występuje w przyrodzie. Znana też jako witamina antystresowa, gdyż działa na gruczoł produkujący adrenalinę.",
    "dailyMale": "1-5",
    "dailyFem": "1-5",
    "unit": "MGRAM",
    "danger": "To jedna z najbezpieczniejszych witamin - jej nadmiar nie wywołuje żadnych dolegliwości.",
    "foodExample": "Wątróbka, Otręby pszenne, Pstrąg, Śledź, Orzechy włoskie, Dziczyzna, Mleko 3%",
    "imgName": "otreby"
  },
  {
    "id": 6,
    "name": "B6",
    "desc": "Jest ona prekursorem niezwykle istotnych koenzymów, które kontrolują przebieg wielu kluczowych reakcji biochemicznych.",
    "dailyMale": "1,8-2,4",
    "dailyFem": "1,8-2,4",
    "unit": "MGRAM",
    "danger": "Witamina ta w nadmiarze może być toksyczna i szkodliwa. Może prowadzić do uszkodzenia nerwów, braku koordynacji mięśni, zwyrodnienia tkanki nerwowej. Uwaga! Niektóre zmiany mogą być nieodwracalne. ",
    "foodExample": "Płatki kukurydziane, Płatki owsiane, Wątróbka, Orzechy włoskie, Soczewica, Ciecierzyca, Kasza gryczana, Ryby, Banany, Szpinak, Awokado, Drób",
    "imgName": "kukurydziane"
  },
  {
    "id": 7,
    "name": "B7",
    "desc": "Witamina B7 - Biotyna zwana również witaminą H to substancja witaminopodobna. Stanowi ona złożony kwas organiczny, który zawiera siarkę. Biotyna jest odporna na działanie wysokich temperatur, dlatego proces gotowania czy smażenia nie ma wpływu na jej zawartość w produktach. Jest ona syntezowana poprzez bakterie jelitowe i pojawia się w szerokiej gamie produktów żywnościowych. Niedobór witaminy H jest zjawiskiem niezwykle rzadko obserwowanym. Najczęstsze przypadki zdarzają się wśród pacjentów szpitali, którzy są karmieni w sztuczny sposób lub długotrwale leczeni sulfonamidami czy antybiotykami, ponieważ hamują one wzrost bakterii , które wytwarzają tę witaminę w organizmie. Dochodzi wtedy do awitaminozy. ",
    "dailyMale": "25-300",
    "dailyFem": "25-300",
    "unit": "UGRAM",
    "danger": "Nie określono objawów.",
    "foodExample": "Wątróbka, Jajka, Orzechy włoskie, Sardynki, Migdały, Ryż naturalny, Szpinak",
    "imgName": "jajka"
  },
  {
    "id": 8,
    "name": "B9",
    "desc": "Kwas foliowy, czyli witamina B9 występuje też pod nazwami witamina B11 i M, kwas foliowy to cała grupa związków występujących pod różną postacią. Kwas foliowy znany jest głównie z przyjmowania go przez kobiety w ciąży oraz te przygotowujące się do zajścia w ciążę. Zapobiega uszkodzeniu cewy nerwowej (jest to zawiązek układu nerwowego) u rozwijającego się w łonie dziecka. Zaleca się przyjmowanie, w okresie miesiąca przed zajściem w ciążę i 3 m-c po zajściu w ciążę, 0,4 mg kwasu foliowego dziennie. Z uwagi na dużą ilość nieplanowanych ciąż zaleca się przyjmowanie kobietom w wieku rozrodczym stałej dawki 0,4 mg dziennie.",
    "dailyMale": "400",
    "dailyFem": "400",
    "unit": "UGRAM",
    "danger": "Mogą wystąpić zaburzenia układu nerwowego i pokarmowego; mogą pojawić się również odczyny alergiczne skóry. Objawy: utrata apetytu, wzdęcia, nudności.",
    "foodExample": "Wątroba, Otręby pszenne, Szpinak, Brukselka, Bób, Kalafior, Brokuły, Jajko, Sałata, Pomarańcze, Sery",
    "imgName": "szpinak"
  },
  {
    "id": 9,
    "name": "B12",
    "desc": "Witamina B12 jest skomplikowanym związkiem chemicznym, który zawiera kobalt jako centralny atom, stąd nazywana jest również kobalaminą. Rozpuszczalna w wodzie jest też odporna na ogrzewanie.",
    "dailyMale": " 1,5-3",
    "dailyFem": " 1,5-3",
    "unit": "UGRAM",
    "danger": "Witamina ta w nadmiarze nie jest toksyczna.",
    "foodExample": "Szczupak, Łosoś, Pstrąg, Makrela, Śledź, Wątróbka, Nerki",
    "imgName": "szczupak"
  },
  {
    "id": 10,
    "name": "C",
    "desc": "To witamina rozpuszczalna w wodzie, nietrwała - wrażliwa na działanie tlenu i wysokich temperatur. Wszelkie suszenie, solenie czy stosowanie środków do konserwowania przetworów niszczą witaminę C. Zwiększa odporność organizmu (mniejsze ryzyko przeziębień i krótszy czas ich trwania), wpływa na wytwarzanie i zachowanie kolagenu (służy do produkcji tkanki łącznej), przyspiesza gojenie ran i zrastanie kości, hamuje tworzenie się sińców, powstawanie krwotoków czy krwawienia z dziąseł,  odpowiada za sprawne funkcjonowanie układu krwionośnego i serca, obniża ciśnienie krwi, chroni przed miażdżycą i odkładaniem się cholesterolu, poprawia przyswajalność żelaza, uczestniczy w regeneracji witaminy E, działa jako przeciwutleniacz (wychwytuje wolne rodniki), chroni organizm przed zmianami nowotworowymi.",
    "dailyMale": "60-70",
    "dailyFem": "60-70",
    "unit": "MGRAM",
    "danger": "Witamina ta jest wydalana z organizmu wraz moczem. Bardzo rzadko jej nadmiar może wywołać dolegliwości żołądkowe, wysypkę; może również przyspieszać tworzenie się kamieni.",
    "foodExample": "Czarna porzeczka, Czerwona papryka, Brukselka, Zielona papryka, Kalafior, Szpinak, Truskawki, Kapusta czerwona, Cytryny, Pomarańcze, Pomidory, Kapusta kwaszona",
    "imgName": "porzeczka"
  },
  {
    "id": 11,
    "name": "D",
    "desc": "Ludzki organizm syntezuje witaminę D pod wpływem światła słonecznego. Jest to witamina rozpuszczalna w tłuszczach, a co za tym idzie może być magazynowana w ludzkim organizmie i niezwykle rzadko pojawiają się jej niedobory. Wpływa głównie na działania fizjologiczne: gospodarka wapniowo - fosforanowa, prawidłowa struktura i funkcje kośćca. Witamina D występuje w dwóch postaciach: D2 - występuje w drożdżach i organizmach roślinnych i D3 - w organizmach zwierzęcych.",
    "dailyMale": "15",
    "dailyFem": "15",
    "unit": "UGRAM",
    "danger": "Czterokrotne przekroczenie zalecanej dawki jest toksyczne. Nadmiar tej witaminy może prowadzić do zwapnienia kości i zębów, biegunki, zmęczenia, wzmożonego oddawania moczu, bólu oczu, świądu skóry, bólów głowy.",
    "foodExample": "Śledź, Makrela, Łosoś, Tuńczyk, Żółtko jajka, Ser żółty, Pokarm kobiecy",
    "imgName": "sledz"
  },
  {
    "id": 12,
    "name": "E",
    "desc": "Witamina E to grupa związków chemicznych, do której zaliczają się tokoferole i tokotrienole. Jest ona stosowana jako dodatek do żywności, pod nazwą E306 (oprócz tego syntetyczne tokoferole występują pod numerami E307 - 309). Jest kluczowym przeciwutleniaczem występującym w komórkach, zalicza się ją do witamin rozpuszczalnych w tłuszczach. Dla ludzkiego organizmu najistotniejszą rolę odgrywa α-tokoferol.",
    "dailyMale": "10",
    "dailyFem": "8",
    "unit": "MGRAM",
    "danger": "Przedawkowanie zdarza się rzadko. Nadmiar tej witaminy przejawia się w postaci m.in. zmęczenia, bólu głowy, osłabienia mięśni, kłopotów ze wzrokiem.",
    "foodExample": "Olej słonecznikowy, Olej sojowy, Migdały, Margaryna, Orzechy, Masło, Jajko, Mleko",
    "imgName": "orzechy"
  },
  {
    "id": 13,
    "name": "F",
    "desc": "Witamina F to zespół wielonienasyconych kwasów tłuszczowych (NNKT). Związki w nich zawarte stanowią budulec komórek, wchodzą w skład błon komórkowych, podnosząc ich trwałość. W skład witaminy F wchodzi odpowiednia proporcja kwasów tłuszczowych: omega 3, omega 6, omega 9, omega 19, omega 23. Kwasy omega 19 i 23 mogą być samodzielnie syntetyzowane przez człowieka, natomiast trzeba zapewnić odpowiednie proporcje pozostałych. Witamina F naturalnie występuje w olejach (z pestek dyni, migdałowym, arachidowym, lnianym, słonecznikowym), tranie, oliwie z oliwek. Można ją znaleźć w kiełkach pszenicy, nasionach dyni, pestkach słonecznika czy migdałach i sporo jest też w rybach morskich. Najlepszą proporcję kwasów omega zawiera olej lniany.",
    "dailyMale": "brak danych",
    "dailyFem": "brak danych",
    "unit": "UNKNOWN",
    "danger": "Witamina ta nie jest toksyczna.  ",
    "foodExample": "Olej lniany",
    "imgName": "len"
  },
  {
    "id": 14,
    "name": "K",
    "desc": "Witaminę K możemy podzielić na witaminę K1 i witaminę K2. Witamina K1 to jasnożółta ciecz o temperaturze topnienia 20°C. Jest rozpuszczalna w tłuszczach, odporna na działanie wysokich temperatura, ale wrażliwa na działanie promieni UV. Witamina K2 ma podobne właściwości fizyczne, ale topi się w 54°C. Witaminy typu K nie są toksyczne nawet w dużych dawkach. Doskonale na pobudzanie naturalnej produkcji witaminy K przez bakterie w jelicie grubym wpływa spożywanie kefirów lub jogurtów między posiłkami.",
    "dailyMale": "80",
    "dailyFem": "65",
    "unit": "UGRAM",
    "danger": "Witamina ta w dużych dawkach nie jest toksyczna. Nadmierne dawki podawane dzieciom mogą uszkadzać ich wątrobę, wywoływać anemię i żółtaczkę.",
    "foodExample": "Szpinak, Brukselka, Brokuły, Sałata, Kalafior, Ogórki, Pomidory",
    "imgName": "bruksela"
  },
  {
    "id": 15,
    "name": "MAGNEZ",
    "desc": "Magnez to jeden z najbardziej pospolitych pierwiastków, występuje w ziemskiej skorupie w ilości 2,74% w postaci minerałów – magnezytu, dolomitu, kizerytu, kainitu, szenitu oraz biszofitu. W ludzkim ustroju znajduje się on we wszystkich komórkach organizmu i zalicza się go do jednego z najcenniejszych biopierwiastków. Mimo, że magnez znajduje się w wielu produktach spożywczych to dostarczamy go relatywnie mniej z powodu niszczenia go w trakcie nawożenia roślin czy konserwowania żywności. Dlatego zaleca się dodatkową suplementację magnzeu.",
    "dailyMale": "300-400",
    "dailyFem": "300-400",
    "unit": "MGRAM",
    "danger": "Duża ilość świadczy o niewydolności nerek - objawy: ospałość, osłabienie, zaczerwienienie skóry, osłabienie mięśni, mrowienie w rękach i w nogach, luźne stolce, biegunka, trudności w oddychaniu.",
    "foodExample": "Kakao, natka pietruszki, Pestki dyni, Orzeszki ziemne, Kasza gryczana, Czekolada gorzka, Orzechy laskowe, Płatki owsiane, Groch, Szpinak, Makrela, Banan",
    "imgName": "kakao"
  },
  {
    "id": 16,
    "name": "POTAS",
    "desc": "Potas jest pierwiastkiem chemicznym pochodzącym z grupy metali alkaicznych w układzie okresowym. Potas został odkryty i wyodrębniony przez sir H. Davy w 1807. Potas wspólnie z chlorem i sodem tworzy główne sole organizmu, czyli elektrolity, które w zasadniczy sposób wpływają na bilansy płynów ustrojowych.",
    "dailyMale": "około 2",
    "dailyFem": "około 2",
    "unit": "GRAM",
    "danger": "Bardzo wysokie stężenie tego pierwiastka może stanowić zagrożenie życia; w przypadku wysokich stężeń potasu w organizmie może dojść do zachwiania równowagi płynów w organizmie, zaburzenia pracy nerek i serca; nadmiar potasu objawia się mrowieniem w okolicy ust i języka, mrowieniem nóg, osłabieniem siły rąk.",
    "foodExample": "Suszone morele, Migdały, Orzechy włoskie, Ziemniaki, Musli, Banan, Wędliny, Brokuły, Melon, Mięso, Ryby, Pomidor, Chleb, Mleko, Jajko, Ogórek",
    "imgName": "morele"
  },
  {
    "id": 17,
    "name": "WAPŃ",
    "desc": "Wapń to minerał niezbędny dla funkcjonowania ludzkiego organizmu. Stanowi on istotny składnik kości, zębów (wapń stanowi 1,4% - 1,66% masy ciała) i odrywa kluczową rolę w przekazywaniu informacji za pomocą nerwów. W  wyniku siedzącego tryby życia może nastąpić odwapnienie kości. Prawidłowe gromadzenie wapnia w dużym stopniu uzależnione jest od ćwiczeń fizycznych. W miejscach gdzie ludzie spożywają twardą wodę z dużą zawartością wapnia, magnezu i litu rzadziej występują zachorowania na choroby sercowe. Wapń i magnez z takiej wody w jelitach łączy się z tłuszczami nasyconymi (wpływają na poziom choresterolu) i wraz z nimi są one usuwane z organizmu.",
    "dailyMale": "900",
    "dailyFem": "900",
    "unit": "MGRAM",
    "danger": "Może zablokować wchłanianie cynku i żelaza; nadmiarowi wapnia towarzyszą: dezorientacja, wysokie ciśnienie krwi, nadwrażliwość skóry i oczu na światło, wzmożone pragnienie, nieregularna praca serca, bóle kości i mięśni, wzmożone oddawanie moczu, metaliczny smak lub suchość w ustach.",
    "foodExample": "Szproty, Żółte sery, Sardynki, Figi suszone, Migdały, Pieruszka, Kapusta włoska, Mleko pełne, Mleko odtłuszczone, Brokuły",
    "imgName": "ser"
  },
  {
    "id": 18,
    "name": "FOSFOR",
    "desc": "Fosfor to pierwiastek chemiczny i niemetal. Jest niemal nierozpuszczalny w wodzie oraz alkoholu. Odkryty został przez niemieckiego alchemika Henniga Branda 1669 roku w Hamburgu w procesie długotrwałego prażenia moczu. W ciele dorosłego człowieka znajduje się około 700 gram fosforu z czego duża część znajduje się w układzie kostnym - około 10%. W przypadku przedawkowania fosforu mogą pojawić się objawy typu: zapalenia organów oraz tkanek miękkich, biegunki, niemożność przyswajania żelaza, cynku oraz magnezu. Na przedawkowanie fosforu wpływa spożywanie dużej ilości gazowanych napojów, mięsa lub częste korzystanie z dań błyskawicznych. ",
    "dailyMale": "800",
    "dailyFem": "800",
    "unit": "MGRAM",
    "danger": "Przedawkowanie tego składnika zdarza się rzadko, ponieważ jest on wydalany wraz z moczem; jeśli jednak dojdzie do zwiększenia poziomu fosforu w organizmie (w przypadku nieprawidłowo funkcjonujących nerek), może dojść do odwapnienia kości, spadku wapnia we krwi i wystąpienia tężyczki; nadmiar fosforu może objawiać się zespołem czerwonych oczu i świądem skóry, a także bólem kości i stawów.",
    "foodExample": "Żółty ser, Wątroba, Orzechy, Żółtko, Warzywa strączkowe, Mięsa, Mleko",
    "imgName": "straczkowe"
  },
  {
    "id": 19,
    "name": "SÓD",
    "desc": "Sód jest pierwiastkiem z grupy metali alkaicznych w układzie okresowym. Jest niezwykle ważny dla ludzkiego organizmu, ponieważ reguluje jego gospodarkę wodną, przez co przyczynia się do zapewnienia napięcia tkanek i nadania jędrności skórze. Ze względu na funkcje jakie sód pełni w ludzkim ustroju jego niedobór może powodować liczne zaburzenia. Trzeba zaznaczyć, że do niedoboru sodu dochodzi bardzo rzadko - najczęściej u osób długotrwale uprawiających wysiłek fizyczny lub nadużywających środków przeczyszczających.",
    "dailyMale": "2-5",
    "dailyFem": "2-5",
    "unit": "GRAM",
    "danger": "Spożycie sodu nie powinno przekraczać 20 g. Wysoki poziom sodu w organizmie powoduje zatrzymanie wody w organizmie, zwiększenia ciśnienia krwi, zwężenia naczyń krwionośnych, a co za tym idzie do nadciśnienia tętniczego oraz obrzęków.",
    "foodExample": "Sól kuchenna, Łosoś wędzony, Kabanosy, Salami popularne, Płatki kukurydziane",
    "imgName": "sol"
  },
  {
    "id": 20,
    "name": "CHLOR",
    "desc": "Chlor to pierwiastek chemiczny, niemetal. Znajduje on szerokie zastosowanie w wyrobie produktów stosowanych każdego dnia. Jest jednocześnie substancją, której potrzebuje organizm ludzki do prawidłowego funkcjonowania. Chlor w organizmie występuje wspólnie z sodem i te dwa pierwiastki dbają o prawidłową gospodarkę wodną w organizmie. Osoby zdrowe zwykle zapewniają sobie te dawki w codziennej diecie.",
    "dailyMale": "3-5",
    "dailyFem": "3-5",
    "unit": "GRAM",
    "danger": "Wysokie stężenie chloru może prowadzić do nadciśnienia tętniczego krwi; nadmiar tego pierwiastka może pojawić się m.in. u osób odwodnionych, chorych na niewydolność nerek, cierpiących na przewlekłą biegunkę.",
    "foodExample": "Sery żółte, Wędliny",
    "imgName": "wedliny"
  },
  {
    "id": 21,
    "name": "CHROM",
    "desc": "Chrom został odkryty w 1797 roku przez naukowca francuskiego Louisa Nicolasa Vauquelina. Nazwa chrom pochodzi z języka greckiego, gdzie oznaczało kolor. Nazwa nie jest przypadkowa - chrom w zależności od stopnia utlenienia tworzy różne związki, które rozpoznaje się na podstawie ich barwy.  W ludzkim organizmie występuje w niewielkich - wręcz śladowych ilościach. Przez lata uznawany był za pierwiastek toksyczny. Jednak w 1957 roku zauważono jego istotną rolę w metabolizmie glukozy. Zapas chromu w organizmie może zostać zniszczony przez nadmiar cukru. Reguluje poziom cholesterolu we krwi.",
    "dailyMale": "50-200",
    "dailyFem": "50-200",
    "unit": "UGRAM",
    "danger": "Zdarza się niezwykle rzadko; pierwiastek ten nie wykazuje działań toksycznych - może jedynie ograniczyć działanie insuliny.",
    "foodExample": "Drożdże piwne, Czarna herbata, Wołowina gotowana, Jabłko, Jaja, Kakao w proszku odtłuszczone, Kukurydza całe ziarno, Miód kwiatowy, Różne rodzaje serów holenderskich, Ziemniaki, Żyto (całe ziarno), Szklanka soku pomarańczowego",
    "imgName": "herbata"
  },
  {
    "id": 22,
    "name": "ŻELAZO",
    "desc": "Żelazo jest pierwiastkiem chemicznym, stanowiącym jeden z mikroelementów niezbędnych do prawidłowego funkcjonowania organizmu. Jest najważniejszym składnikiem czerwonego barwnika krwi - hemoglobiny. Zapotrzebowanie człowieka na żelazo zależy od wieku, płci czy stanu organizmu więc dzienna norma waha się w szerokich granicach. Niedobory pojawiają się przede wszystkim w stanach zwiększonego zapotrzebowania, przy zaburzeniach wchłaniania lub zbyt dużym wydalaniu tego pierwiastka. W takich sytuacjach wprowadzana jest suplementacja preparatami żelaza. Stosuje się to przede wszystkim: u osób, które przeszły zabiegi operacyjne z dużą utratą krwi, u kobiet ciężarnych i karmiących, u osób z krwawieniami z układu pokarmowego lub dróg rodnych, u dzieci po konflikcie serologicznym, u wcześniaków, u osób z zaburzonym wchłanianiem żelaza.",
    "dailyMale": "10-15",
    "dailyFem": "18",
    "unit": "MGRAM",
    "danger": "Wysokie stężenie żelaza w organizmie może być przyczyniać się do chorób serca oraz nowotworów.",
    "foodExample": "Generalnie podroby, wytwory podrobowe- głównie pasztet. Można go zrobić z: śledziona wołowa, śledziona wołowa duszona, wątroba wieprzowa, śledziona wieprzowa, śledziona wieprzowa, duszona, płuca wieprzowe, wątroba wieprzowa, duszona, płuca wieprzowe, duszone, wątroba wieprzowa. Dodatkowo: płatki kukurydziane z witaminami i żelazem, kakao 16% proszek. ",
    "imgName": "pasztet"
  },
  {
    "id": 23,
    "name": "CYNK",
    "desc": "Cynk stanowi jeden z najistotniejszych mikroelementów, co potwierdzono dopiero w 1957 roku. Bierze on udział w wielu procesach, w tym także w przemianach metabolicznych.",
    "dailyMale": "12-20",
    "dailyFem": "12-20",
    "unit": "MGRAM",
    "danger": "Bardzo rzadko się zdarza; zbyt wysokie stężenie tego pierwiastka może prowadzić do anemii, osłabienia odporności organizmu, podwyższenia cholesterolu. ",
    "foodExample": "dynia, pestki, kakao 16%, proszek, wątroba wieprzowa, ser ementaler tłusty, fasola biała, nasiona suche, wołowina, pieczeń, kasza gryczana, salami popularne, migdały, wieprzowina, karkówka, płatki owsiane, słonecznik, nasiona, kiełbasa śląska, chleb żytni razowy",
    "imgName": "dynia"
  },
  {
    "id": 24,
    "name": "JOD",
    "desc": "Jod jest pierwiastkiem chemicznym z grupy fluorowców układu okresowego. Zdrowy ludzki organizm posiada od 30 do 50 miligramów jodu, z czego większość znajduje się w gruczole tarczycy, jako niezbędny składnik do produkcji hormonów. Niedobory tego pierwiastka występują przede wszystkim w rejonach górskich, ponieważ im większa odległość od morza tym gleby mają mniejsze stężenie jodu. ",
    "dailyMale": " 50-75",
    "dailyFem": " 50-75",
    "unit": "UGRAM",
    "danger": "Wysokie dawki jodu mogą zaburzać pracę tarczycy - przyczyniać się do powstania wola jodowego;  objawy towarzyszące tej chorobie to: nerwowość, przyspieszona przemiana materii, szybki spadek masy ciała, wytrzeszcz oczu.",
    "foodExample": "sól kuchenna, jodowana, dorsz świeży, mintaj świeży, makrela wędzona, ser edamski tłusty, sardynka w pomidorach, tuńczyk w oleju, orzechy laskowe",
    "imgName": "dorsz"
  },
  {
    "id": 25,
    "name": "SELEN",
    "desc": "Jego nazwa pochodzi od greckiego słowa – selene, oznaczającego księżyc, ponieważ zawsze występuje razem z tellurem, a tellus znaczy ziemia. Stanowi on jeden z niezbędnych do życia mikroelementów choć do drugiej połowy XX wieku, kiedy odkryte zostały jego istotne funkcje uznawany był za pierwiastek toksyczny. elen jest niezwykle ważnym składnikiem diety szczególnie w okresie jesienno - zimowym, kiedy wokół jest sporo bakterii oraz wirusów. Selen wraz z witaminą E wzmacnia układ odpornościowy, poprzez zwiększenie ilości przeciwciał.",
    "dailyMale": "50-200",
    "dailyFem": "50-200",
    "unit": "UGRAM",
    "danger": "W dużych dawkach jest bardzo toksyczny; nadmiar selenu powoduje: łysienie, uszkodzenie skóry, puchnięcie palców, wymioty, przemęczenie.",
    "foodExample": "łosoś świeży, łosoś wędzony, jaja kurze całe, kasza gryczana, kakao, proszek, szynka wędzona, ser, ementaler pełnotłusty, wieprzowina, schab, ryż biały",
    "imgName": "gryczana"
  }
]